[
  {
    "ad_id": "o20d63",
    "article_url": "https://dealstream.com/d/biz-sale/manufacturing/o20d63",
    "title": "Distribution and Manufacturing Portfolio",
    "source": "dealstream",
    "category": "Manufacturing",
    "location": "New York, NY",
    "asking_price": "4,275,000",
    "sales_price": "11,147,775",
    "cash_flow": "959,860",
    "Ebita": "959,860",
    "listing_photo": "https://res.cloudinary.com/mergernetwork/image/upload/h_400,f_auto/posts/28DAF0B2-5213-40B5-9CF8A2BAB8191C6A",
    "description": "Entity 1 (manufacturing) \r\nSpecializes in manufacturing custom die-cut corrugated and foam packaging. The company comes with commercial equipment, including a flatbed die cutter, a clam shell die cutter, and a clicker press, ensuring precision and versatility in production. They also possess a guillotine...",
    "details": [
      "Entity 1 (manufacturing) \rSpecializes in manufacturing custom die-cut corrugated and foam packaging. The company comes with commercial equipment, including a flatbed die cutter, a clam shell die cutter, and a clicker press, ensuring precision and versatility in production. They also possess a guillotine cutter for exact resizing and a glue machine for seamless substrate bonding. With 95% of their work being custom orders, they excel at delivering tailored packaging solutions that meet the unique needs of their clients. This capability allows them to maintain long-term relationships and consistent repeat business.\r\rEntity 2 Distribution (DTC & B2B)\rStarted as an e-commerce site and has successfully transitioned to a direct-to-consumer model, primarily through targeted mailers and catalogs. As a distribution company, they deliver high-quality packaging directly to end users This strategic shift has resulted in a loyal customer base, with the majority of sales coming from repeat business. The company sends out extensive marketing materials to a carefully curated list to repeat business owners, ensuring targeted outreach and effective market penetration.\r\rEntity 3\rExcels in the distribution of a wide range of packaging materials, similar to ULine, leveraging a robust network of referrals, strategic marketing, and a dedicated sales force. The company brokers products directly from manufacturers to customers. With a significant inventory of $350,000, they are well-positioned to meet the diverse needs of its clients promptly. Their strategic location and weekly brokerage activities enable them to maintain a steady flow of business and high customer satisfaction.\r\rTogether, these businesses offer a one-stop-shop for all packaging needs,\rwith a strong focus on customization, targeted marketing, and customer satisfaction.\r\rAsking Price: $4,275,000\rInventory (Included in asking\rprice): $650,000\rGross Revenue: $11,147,775\rS.D.E: $959,860\r\rFeel free to reach out for an NDA"
    ]
  },
  {
    "ad_id": "77h7sj",
    "article_url": "https://dealstream.com/d/biz-sale/dental-practices/77h7sj",
    "title": "Arkansas Dentist $1.1M+ Collections $500K Earnings",
    "source": "dealstream",
    "category": "Dental Practices, Clinics",
    "location": "Springdale, AR",
    "asking_price": "1,000,000",
    "sales_price": "1,130,036",
    "cash_flow": "516,179",
    "Ebita": "516,179",
    "listing_photo": "https://res.cloudinary.com/mergernetwork/image/upload/h_400,f_auto/posts/620F7DE9-D637-4F8B-97A8456521B0190E",
    "description": "This well established, thriving and extremely\r\nprofitable dental practice is located in a\r\nCentral Arkansas city of around 40,000 people\r\nless than an hour away from Little Rock. It has\r\nbeen in operation for decades and\r\nconsistently does over a million dollars in\r\ncollections for the selling dentist...",
    "details": [
      "This well established, thriving and extremely\rprofitable dental practice is located in a\rCentral Arkansas city of around 40,000 people\rless than an hour away from Little Rock. It has\rbeen in operation for decades and\rconsistently does over a million dollars in\rcollections for the selling dentist each year. It\rhas a very established patient base with\rreliable and seasoned employees already in\rplace. The practice concentrates on general,\rpreventative and cosmetic restorative\rdentistry. The practice is modern, digital and\rhas five good-sized operating rooms in an\restablished location owned by the selling\rdentist that they are willing to sell with the\rpractice. Everything is already set up and\rready for a new dentist to come in and take\rover. The selling dentist is also willing to stay\ron for a negotiated time to help with the\rtransition. Financing is also available for\rqualified buyers with our lending program\rthat gets you in front of many lenders who\rcompete for your business to get you the best\rterms on a loan. Contact us today to learn\rmore."
    ]
  },
  {
    "ad_id": "ignwn2",
    "article_url": "https://dealstream.com/d/biz-sale/long-haul-trucking/ignwn2",
    "title": "Profitable Refrigerated Trucking Powerhouse",
    "source": "dealstream",
    "category": "Long Haul Trucking",
    "location": "Salt Lake City, UT",
    "asking_price": "7,495,000",
    "sales_price": "7,844,320",
    "cash_flow": "2,304,306",
    "Ebita": "2,304,306",
    "listing_photo": "https://res.cloudinary.com/mergernetwork/image/upload/h_400,f_auto/posts/8C6B4150-F5EF-4870-BE07C9AE7124CB6C",
    "description": "This established Utah trucking company offers a winning combination of experience and growth potential. Specializing in refrigerated, tanker, and dry van trucking for all 48 states, they operate 24/7 with a reliable fleet of new equipment. Their long-standing client relationships and well-defined processes...",
    "details": [
      "This established Utah trucking company offers a winning combination of experience and growth potential. Specializing in refrigerated, tanker, and dry van trucking for all 48 states, they operate 24/7 with a reliable fleet of new equipment. Their long-standing client relationships and well-defined processes ensure clear communication and on-time deliveries. With a strong upward sales trend and a dedicated team in place, this business is primed for further success in the hands of the right buyer. \r\rThis is a leased location of 1500 square feet with a Total monthly rent of $2200. Lease is month to month. Seller is active with 28FT and 2PT employees. Hours of operation are 24/7. $4,811,000 in FF&E included in the asking price."
    ]
  },
  {
    "ad_id": "6iryas",
    "article_url": "https://dealstream.com/d/biz-sale/medical-practices/6iryas",
    "title": "Growing Urgent Care with Drug Testing Contracts",
    "source": "dealstream",
    "category": "Medical Practices, Clinics, Therapy Centres",
    "location": "Florida",
    "asking_price": "1,300,000",
    "sales_price": "1,049,000",
    "cash_flow": "345,000",
    "Ebita": "345,000",
    "listing_photo": null,
    "description": "The primary care side still uses the urgent care side for insurance billing purposes while it gets\r\nfully credentialed.\r\nThe Urgent Care side is fully credentialed with all insurance carriers.\r\n eClinicalWorks is their Electronic Medical Records EMR software.\r\n They just recently started their primary...",
    "details": [
      "The primary care side still uses the urgent care side for insurance billing purposes while it gets\rfully credentialed.\rThe Urgent Care side is fully credentialed with all insurance carriers.\r eClinicalWorks is their Electronic Medical Records EMR software.\r They just recently started their primary care branch after inheriting hundreds of patients from a\rmedical practice where the owner passed. They currently see 30 patients a day and the seller\rsaid if they were in better shape they could see closer to 40 a day for primary care.\r The primary care division sees patients only 4 days a week due to the seller's health.\r The urgent care division sees 45 to 65 patients a day averaging 220 to 240 patients a week.\rDue to the seller's health, Urgent Care went from 7 days a week to opening only 4 days a week.\r They also shortened the hours, so the business was easier to handle.\r Their customer base is typically covered under Tricare, BlueCross BlueShield or Medicare.\r The primary care practice is credentialed with most of the major insurance companies.\r The urgent care division currently handles workers comp cases, DOT physicals, physicals for\rsummer camps, physicals for school bus drivers, physicals for high schools, nursing home and\rphysicals for law enforcement/ fire department and city employees.\r Drug testing for all city employees and construction companies and recently signed contracts. \r Urgent Care also issues prescriptions, take mammograms, and does blood work.\r There are 6 exam rooms. Two separate areas, one for Urgent Care Patients and one for Primary\rCare patients.\r Waiting room seats up to 14 people.\r There is an IV room with 6 beds in it..\r All of the contracts are for the practice with insurance companies rather than through\rindividuals.\r There are no medical facilities nearby.\r All of the workers live locally.\r The Business can run all kinds of blood and urine testing in house, health/IV Lounge treatments,\rEKG/Lung examinations, burn care, skin care, eye injuries, sutures, and can perform ultrasounds.\rDoctor will assist as long as possible. Willing to do TeleMed to help.\r\rPlease Note, Large Cash component."
    ]
  },
  {
    "ad_id": "q71wlm",
    "article_url": "https://dealstream.com/d/biz-sale/waste-management/q71wlm",
    "title": "Busy and Profitable Junk Hauling Business",
    "source": "dealstream",
    "category": "Waste Management and Remediation Services",
    "location": "Boston, MA",
    "asking_price": "229,500",
    "sales_price": "875,000",
    "cash_flow": "210,000",
    "Ebita": "210,000",
    "listing_photo": null,
    "description": "The business sale includes a Decaled Hauling Truck and National Accounts in place. This is a busy “eco-friendly - Green” junk removal and recycling business geared toward residential and commercial clients. The business has established a proven marketing system, with a detailed website and a corporate...",
    "details": [
      "The business sale includes a Decaled Hauling Truck and National Accounts in place. This is a busy “eco-friendly - Green” junk removal and recycling business geared toward residential and commercial clients. The business has established a proven marketing system, with a detailed website and a corporate call center available to answer in-coming calls while you are out serving customers and building the business. The Call Center manages calls and schedules jobs in real time. The business has multiple revenue streams and profit centers. This business has a verifiable cash flow and 10-year track record of success. Customers truly appreciate these services and are happy to pay their invoice after the debris and clean-up occurs. Full training and ongoing corporate support will be included with this sale."
    ]
  },
  {
    "ad_id": "9w7ae3",
    "article_url": "https://dealstream.com/d/biz-sale/pet-grooming/9w7ae3",
    "title": "Recession Resistant Dog Training Franchise",
    "source": "dealstream",
    "category": "Pet Grooming and Boarding, Kennels, Catteries",
    "location": "Bonita Springs, FL",
    "asking_price": "225,000",
    "sales_price": "462,389",
    "cash_flow": "110,000",
    "Ebita": "110,000",
    "listing_photo": "https://res.cloudinary.com/mergernetwork/image/upload/h_400,f_auto/posts/681DC254-21B3-4FA9-94A894B4AACE087F",
    "description": "Recession Resistant Dog Training Franchise SC2148\r\n\r\nThis Recession Resistant Florida based Dog Training Franchise is a Florida Limited Liability Company and has been in operation for the past 8 years and under the current ownership for the past 6 years. This franchise is the nation’s top franchise...",
    "details": [
      "Recession Resistant Dog Training Franchise SC2148\r\rThis Recession Resistant Florida based Dog Training Franchise is a Florida Limited Liability Company and has been in operation for the past 8 years and under the current ownership for the past 6 years. This franchise is the nation’s top franchise when it comes to dog training. They have approximately 2 years remaining on the franchise agreement. They provide day camp training, private lessons, and group classes. They also offer specialty classes and puppy classes. Additional services include daycare, boarding, grooming and the potential to grow further into these services. There are almost 160 franchise locations across the United States. There is not just dog training service revenue, but also merchandise sales at these locations as well. Since this location is in Florida, they receive seasonal clients from the other 160 locations which also provides additional revenue.\r\rAsking Price $225,000\rCash Flow $110,000\rGross Revenue $462,389\rDown Payment $225,000\r\rBusiness Location: Bonita Springs, Lee County, Florida\r\rReason for Sale\rThe Seller is selling to pursue other interests.\r\rDetailed information\r\rYear Established: 2015\rHome Based: No\rFranchise: Yes\rRelocatable: No\rLender Prequalified: No\rSBA Prequalified: No\rFull-Time Employees: 3\rPart-Time Employees: 1\rContractors: N/A\rOwner Worked Hours/w: 40\rAdjusted EBITDA: $105,408\rInventory Included: Yes\rInventory Value: $2,000\rMonthly Rent: $4,400\rReal Estate Available: No\rReal Estate Included: No\rReal Estate Value: N/A\rBuilding Size: 2,336\rFF&E Included?: Yes\rFF&E Value: $50,000\rTraining/Support\r\rThere will need to be a 3-week certification course needed for the new owner, manager or designee. The Seller is willing to provide training at 30 hours per week for 4 weeks for the new Owner. Additional training can be made available at a mutually agreed upon cost to the new Owner.\rMarket Outlook/Competition\r\rThe $100 billion pet industry is poised to nearly triple to $275 billion by 2030 thanks to a surge in new owners, favorable demographics, and increased pet-per spending. The pandemic has upended the lives of humans, but for pets, it’s been a bonanza. Two-thirds of U.S. households have at least one pet, with 1.7 on average.\r\rCA 02100708\rNV 1003039"
    ]
  },
  {
    "ad_id": "qbf0js",
    "article_url": "https://dealstream.com/d/biz-sale/pharmacies/qbf0js",
    "title": "NY Retail Pharmacy",
    "source": "dealstream",
    "category": "Pharmacies, Drug Stores, Chemists",
    "location": "New York",
    "asking_price": "5,200,000",
    "sales_price": "29,595,113",
    "cash_flow": "2,943,565",
    "Ebita": "2,943,565",
    "listing_photo": "https://res.cloudinary.com/mergernetwork/image/upload/h_400,f_auto/posts/3026FA5D-F430-4088-AE8E733BFD40B8D5",
    "description": "This pharmacy in the the Boroughs is fully licensed with clean contracts.  \r\nAll staff is fully trained and passionate about assisting the community (English, Russian and Spanish speaking staff).  \r\n\r\nAnnual Sales\t$29,595,113.00\r\nGross Profit\t$6,541,175.00\r\nEBITDA\t$2,943,565.00\r\nAnnual Rx Count\t140179\r\n\r\nAsking...",
    "details": [
      "This pharmacy in the the Boroughs is fully licensed with clean contracts.  \rAll staff is fully trained and passionate about assisting the community (English, Russian and Spanish speaking staff).  \r\rAnnual Sales\t$29,595,113.00\rGross Profit\t$6,541,175.00\rEBITDA\t$2,943,565.00\rAnnual Rx Count\t140179\r\rAsking Price\t$5,200,000 plus inventory (excluding cash, cash equivalents and A/R)"
    ]
  },
  {
    "ad_id": "niz3o6",
    "article_url": "https://dealstream.com/d/biz-sale/construction/niz3o6",
    "title": "Local, Content Damage Restoration Company",
    "source": "dealstream",
    "category": "Construction",
    "location": "Hempstead, NY",
    "asking_price": "299,900",
    "sales_price": "1,600,000",
    "cash_flow": "400,000",
    "Ebita": "400,000",
    "listing_photo": null,
    "description": "The sale price includes a vehicle, an extensive equipment package, storage vaults and everything needed to run daily operations. Included are built-in National accounts and access to third-party insurance administrators. We also receive referral business from property restoration companies inside the...",
    "details": [
      "The sale price includes a vehicle, an extensive equipment package, storage vaults and everything needed to run daily operations. Included are built-in National accounts and access to third-party insurance administrators. We also receive referral business from property restoration companies inside the territory. This is an extremely high margin, proven recession resistant residential, B2B and B2C company. Excellent profit margins with high earnings. The average per ticket transaction is large. This business is great for someone with excellent executive management and project management skills. In addition, if you are a person that excels at bringing different parties together focused on completing projects this is a great fit for you. Contents restoration is covered by insurance. For an insurance company, it's much less expensive to clean and restore an item than it is to replace it. For a homeowner or property owner, they'd usually much rather have their item that has sentimental value. Included in this sale is extensive training as well as ongoing support. As the new owner, you will provide financial oversight, building relationships, and networking in the community. In addition, included in this sale, there are many existing insurance company relationships and restoration businesses providing reoccurring and ongoing revenue. This “essential” and needs based service business is highly scalable with continued growth potential."
    ]
  },
  {
    "ad_id": "2o519l",
    "article_url": "https://dealstream.com/d/biz-sale/builders/2o519l",
    "title": "Thriving Insulation Company in Baltimore, MD",
    "source": "dealstream",
    "category": "General Contractors, Builders, Housebuilders",
    "location": "Baltimore County, MD",
    "asking_price": "200,000",
    "sales_price": "715,000",
    "cash_flow": "150,000",
    "Ebita": "150,000",
    "listing_photo": "https://res.cloudinary.com/mergernetwork/image/upload/h_400,f_auto/posts/47D44BA8-5C42-48CD-A10786537FB3727D",
    "description": "This thriving insulation company in Baltimore, MD presents an incredible opportunity for an entrepreneur looking to enter a profitable and essential industry. With a proven business model and a strong customer base, this company specializes in providing top-notch insulation solutions for both residential...",
    "details": [
      "This thriving insulation company in Baltimore, MD presents an incredible opportunity for an entrepreneur looking to enter a profitable and essential industry. With a proven business model and a strong customer base, this company specializes in providing top-notch insulation solutions for both residential and commercial properties. The business boasts a team of skilled technicians, state-of-the-art equipment, and a reputation for delivering exceptional service and energy-efficient solutions that significantly reduce energy costs for clients.\r\rHighlights:\r\r❖ Prime location in Baltimore, MD with a solid market presence.\r❖ Strong and consistent revenue with high-profit margins.\r❖ Loyal and diverse clientele, including homeowners, contractors, and businesses.\r❖ Excellent opportunities for expansion and scaling within the growing insulation industry.\r\rThis is a rare chance to acquire a profitable business in a high-demand sector. Don’t miss out on this exceptional investment opportunity!"
    ]
  },
  {
    "ad_id": "vu6z7v",
    "article_url": "https://dealstream.com/d/biz-sale/pubs/vu6z7v",
    "title": "Vibrant Nightlife Hotspot in Salt Lake County",
    "source": "dealstream",
    "category": "Bars, Taverns, Pubs, Lounges",
    "location": "Salt Lake County, UT",
    "asking_price": "3,500,000",
    "sales_price": "3,498,449",
    "cash_flow": "568,665",
    "Ebita": "568,665",
    "listing_photo": "https://res.cloudinary.com/mergernetwork/image/upload/h_400,f_auto/posts/78D4724D-67B0-4D0A-8FD49D1E6DB622CF",
    "description": "This well-established bar and nightclub in Salt Lake County offers a vibrant atmosphere, a dedicated clientele, and a proven track record of success. Featuring a diverse menu, signature cocktails, and top-notch entertainment, this unique multi-level venue caters to a wide audience. Its longstanding...",
    "details": [
      "This well-established bar and nightclub in Salt Lake County offers a vibrant atmosphere, a dedicated clientele, and a proven track record of success. Featuring a diverse menu, signature cocktails, and top-notch entertainment, this unique multi-level venue caters to a wide audience. Its longstanding success and prime location on a bustling main street create a solid foundation for continued growth, making it an excellent opportunity for a buyer seeking a thriving business in a dynamic market.\rHoused in a beautifully renovated 19th-century building, the bar boasts a loyal customer base and a reputation for exceptional food, drinks, and entertainment. The venue's unique atmosphere seamlessly blends classic charm with modern style, ensuring a memorable experience for all patrons. This is a fantastic opportunity to acquire a successful business with significant growth potential.\rThis thriving establishment is known for its:\r1. Diverse Menu: From creative small plates to signature entrees, the menu caters to a variety of palates.\r2. Top-Notch Beverages: Featuring a curated selection of local craft beers, handcrafted cocktails, and distinctive wines, there's something for every taste.\r3. Live Entertainment: This establishment offers a lively atmosphere with regular DJ performances, perfect for socializing and enjoying the night.\r4. Prime Location: Situated on a well-trafficked main street, the bar enjoys excellent visibility and easy access for customers.\rCompetitive Advantages:\r1. Longstanding Clientele: Years of consistent service have built a strong and loyal customer base.\r2. Prime Location: High foot traffic and convenient access ensure a steady stream of patrons.\r3. Proven Track Record: A history of success demonstrates the bar's strong appeal and profitability.\r4. Unique Atmosphere: The historic building and multi-level layout create a memorable experience for guests.\r5. Diversified Revenue Streams: Food, drinks, and entertainment contribute to a healthy\r\rThis is a leased location of 12,600 square feet with Total Monthly Rent of $31,141. Lease ends May 2025. Seller is active in the business with 20 FT and 16 PT employees. Hours of operation are Tuesday – Saturday 5pm-1am and Sunday 11am-1pm. $250,000 in Inventory and $680,000 in FF&E included in asking price. $1,000,000 made in Leasehold Improvements. DABS Liquor License approval required."
    ]
  },
  {
    "ad_id": "vpe8cd",
    "article_url": "https://dealstream.com/d/biz-sale/carpenters/vpe8cd",
    "title": "Custom Cabinet Manufacturer, Huge Growth Potential",
    "source": "dealstream",
    "category": "Carpentry and Joinery",
    "location": "California",
    "asking_price": "499,000",
    "sales_price": "800,000",
    "cash_flow": "100,000",
    "Ebita": "100,000",
    "listing_photo": "https://res.cloudinary.com/mergernetwork/image/upload/h_400,f_auto/posts/A7123CDC-5DA4-4ED4-8D6A105E318042FF",
    "description": "Northern California Custom Cabinet Manufacturer With Huge Growth Potential - SC2183\r\n\r\nFinancial Information\r\nAsking Price: $499,000\r\nCash Flow: $100,000\r\nGross Revenue: $800,000\r\nDown Payment: $499,000\r\n \r\nThis Northern California based Custom Cabinet Manufacturer is a California Sub-Chapter S Corporation...",
    "details": [
      "Northern California Custom Cabinet Manufacturer With Huge Growth Potential - SC2183\r\rFinancial Information\rAsking Price: $499,000\rCash Flow: $100,000\rGross Revenue: $800,000\rDown Payment: $499,000\r \rThis Northern California based Custom Cabinet Manufacturer is a California Sub-Chapter S Corporation that has been in operation for the past 42 years. They have been creating beautiful factory direct cabinets since 1980. They are dedicated to proper planning with careful attention to budget, a one – two combination that produces stunning results for the client who is remodeling a kitchen or building a new home. This company believes there is no substitute for complete communication and attention to detail at the start of the project, to give you the best value in the products and service you deserve.\r\rBusiness Location\rCity: Northern California\rState: California\r \rReason for Sale\rThe reason for selling is that the Sellers are looking to retire.\r \rDetailed information\rYear Established: 1982\rHome Based: No\rFranchise: No\rRelocatable: No\rLender Prequalified: No\rSBA Prequalified: No\rFull-Time Employees: 3\rPart-Time Employees: 1\rContractors: N/A\rOwner Worked Hours/w: 25\rAdjusted EBITDA: $100,000\rInventory Included: Yes\rInventory Value: $25,000\rMonthly Rent: $8,000\rReal Estate Available: Yes\rReal Estate Included: No\rReal Estate Value: On request\rBuilding Size: 8000\rFF&E Included?: Yes\rFF&E Value: $250,000\r \rTraining/Support\rThe Seller is willing to provide training for 4 weeks at 20 hours per week. Additional training may be available at mutually agreed upon terms between the Buyer and the Seller.\r \rMarket Outlook/Competition\rDemand for cabinets in the US is forecast to rise 3.1% annually to $26.5 billion in 2026. Growth will be driven by increases in unit demand, as prices for lumber and associated wood materials (the most popular materials for cabinets) moderate significantly from inflation- and supply chain-related highs in 2021 and 2022.\r \rReal Estate Description\rThey operate out of a 8,000 square foot manufacturing space, and they also have 1,100 square feet of loft inside of the building. The rent is currently at $8,000 per month on a NNN lease. The Seller does own the building and property, and it may be available for sale dependent upon the needs of the Buyer and the Lender.\r \rCA 02100708\rNV 1003039"
    ]
  },
  {
    "ad_id": "arczu5",
    "article_url": "https://dealstream.com/d/biz-sale/flooring/arczu5",
    "title": "SE Idaho Wood Flooring Experts",
    "source": "dealstream",
    "category": "Flooring Contractors",
    "location": "Bannock County, ID",
    "asking_price": "285,000",
    "sales_price": "236,178",
    "cash_flow": "109,978",
    "Ebita": "109,978",
    "listing_photo": "https://res.cloudinary.com/mergernetwork/image/upload/h_400,f_auto/posts/0B41F6A1-5406-483E-9C575F9DF164BD12",
    "description": "Bringing over 28 years of flooring expertise to Southeastern Idaho, this wood flooring company offers quality installation, dustless sanding, refinishing, and repairs. With a commitment to quality and honest service, the business has established a strong reputation and almost no competition in the market.\r\n\r\nA...",
    "details": [
      "Bringing over 28 years of flooring expertise to Southeastern Idaho, this wood flooring company offers quality installation, dustless sanding, refinishing, and repairs. With a commitment to quality and honest service, the business has established a strong reputation and almost no competition in the market.\r\rA key asset to potential buyers is the long-time employee who possesses extensive industry experience and can seamlessly assume the role of General Manager. This ensures continuity in operations and management, particularly advantageous for buyers not based locally. The company enjoys a lucrative market with significant growth potential, evidenced by its upward sales trend and impressive profitability.\r\rProudly serving the area, this business presents a prime opportunity for buyers looking to enter or expand in the wood flooring industry.\r\rThis is home-based and relocatable. Seller is active with 2 FT employees. Hours of operation are 8am – 5pm Monday to Friday. $50,000 in FF&E included in the asking Price."
    ]
  },
  {
    "ad_id": "kbaok9",
    "article_url": "https://dealstream.com/d/biz-sale/pharmacies/kbaok9",
    "title": "Long Standing Community Pharmacy in IL",
    "source": "dealstream",
    "category": "Pharmacies, Drug Stores, Chemists",
    "location": "Illinois",
    "asking_price": "2,100,000",
    "sales_price": "6,319,205",
    "cash_flow": "688,693",
    "Ebita": "688,693",
    "listing_photo": "https://res.cloudinary.com/mergernetwork/image/upload/h_400,f_auto/posts/E8D932D9-6C8C-4371-97AA63F3D8C3C626",
    "description": "Long Standing pharmacy serving the community for over 25 years. The pharmacy has an outstanding 27% margin! Clean contracts and licenses and well trained staff. Seller is looking to retire but will support during transition as requested to ensure a smooth transition for patients and staff.\r\n\r\nYears...",
    "details": [
      "Long Standing pharmacy serving the community for over 25 years. The pharmacy has an outstanding 27% margin! Clean contracts and licenses and well trained staff. Seller is looking to retire but will support during transition as requested to ensure a smooth transition for patients and staff.\r\rYears in Business\t25\rAnnual Sales\t$6,319,205.00\rGross Profit\t$1,733,811.00\rEBITDA\t$688,693.00\rAnnual Rx Count\t72771\r\rAsking Price\t$2,100,000 plus inventory (excluding cash, cash equivalents and A/R)"
    ]
  },
  {
    "ad_id": "q0rf2u",
    "article_url": "https://dealstream.com/d/biz-sale/pharmacies/q0rf2u",
    "title": "Two Long Standing Texas Pharmacies",
    "source": "dealstream",
    "category": "Pharmacies, Drug Stores, Chemists",
    "location": "Dallas, TX",
    "asking_price": "850,000",
    "sales_price": "3,384,763",
    "cash_flow": "238,528",
    "Ebita": "238,528",
    "listing_photo": "https://res.cloudinary.com/mergernetwork/image/upload/h_400,f_auto/posts/560302B4-3386-4597-9037A0E9F3676632",
    "description": "These two pharmacies have been in business for 17 years. The Seller has a loyal customer base and they are excited to pass the businesses down to a buyer who will continue to serve the community. All licenses and contracts are active and in good standing.\r\n\r\nYears in Business\t17\r\nAnnual Sales\t$3,384,763.31\r\nGross...",
    "details": [
      "These two pharmacies have been in business for 17 years. The Seller has a loyal customer base and they are excited to pass the businesses down to a buyer who will continue to serve the community. All licenses and contracts are active and in good standing.\r\rYears in Business\t17\rAnnual Sales\t$3,384,763.31\rGross Profit\t$865,107.84\rEBITDA\t$238,528.00\rAnnual Rx Count\t43655\r\rAsking Price\t$850,000 plus inventory (excluding cash, cash equivalents and A/R)"
    ]
  },
  {
    "ad_id": "401on3",
    "article_url": "https://dealstream.com/d/biz-sale/paving/401on3",
    "title": "Profitable Full-Service Asphalt & Paving Company",
    "source": "dealstream",
    "category": "Paving Contractors",
    "location": "Salt Lake County, UT",
    "asking_price": "1,000,000",
    "sales_price": "1,191,296",
    "cash_flow": "368,892",
    "Ebita": "368,892",
    "listing_photo": "https://res.cloudinary.com/mergernetwork/image/upload/h_400,f_auto/posts/F4096882-A516-4C52-806A7C4CEA9767B0",
    "description": "This thriving full-service asphalt and paving company in Salt Lake County is experiencing robust revenue growth and boasts a healthy Seller's Discretionary Earnings (SDE). Key employees are committed to staying on, ensuring a smooth transition. The business is thriving thanks to its strong referrals,...",
    "details": [
      "This thriving full-service asphalt and paving company in Salt Lake County is experiencing robust revenue growth and boasts a healthy Seller's Discretionary Earnings (SDE). Key employees are committed to staying on, ensuring a smooth transition. The business is thriving thanks to its strong referrals, and stellar reputation. Its competitive edge includes extensive experience, a dedicated team, and exceptional professionalism. Easily relocatable and currently home-based, this business presents significant growth opportunities and is an ideal investment for buyers seeking a thriving, expandable enterprise. \r\r Seller is active with 3FT and 6 Contract employees. Hours of operation are 9 am - 5 pm Monday-Friday. $179,000 in FF&E included in the asking price. General Contractors license required."
    ]
  },
  {
    "ad_id": "cq49ed",
    "article_url": "https://dealstream.com/d/biz-sale/pharmacies/cq49ed",
    "title": "Twin Cities Community Pharmacy",
    "source": "dealstream",
    "category": "Pharmacies, Drug Stores, Chemists",
    "location": "Minnesota",
    "asking_price": "675,000",
    "sales_price": "3,995,750",
    "cash_flow": "301,511",
    "Ebita": "301,511",
    "listing_photo": "https://res.cloudinary.com/mergernetwork/image/upload/h_400,f_auto/posts/2E724A54-1D65-4FB7-88AA0D347FE9F3A9",
    "description": "Twin Cities area Pharmacy is fully staffed with well-trained employees.\r\nAll major PBM contracts are in place and contracted directly whenever possible.\r\nThis pharmacy has a loyal customer base. Pharmacy is available for either stock or asset transaction. Licenses and contracts are all in good standing.\r\nOwner...",
    "details": [
      "Twin Cities area Pharmacy is fully staffed with well-trained employees.\rAll major PBM contracts are in place and contracted directly whenever possible.\rThis pharmacy has a loyal customer base. Pharmacy is available for either stock or asset transaction. Licenses and contracts are all in good standing.\rOwner occupied building. Real estate is available for purchase.\r\rAnnual Sales $3,995,750.00\rGross Profit $1,056,368.00\rEBITDA $301,511.00\rAnnual Rx Count 62588\r\rAsking Price $675,000 plus inventory (Excludes Cash, Cash Equivalents, and Accounts Receivable)"
    ]
  }
  [
    {
      "ad_id": "6047ho",
      "article_url": "https://dealstream.com/d/biz-sale/accounting/6047ho",
      "title": "Suffolk County Practice for Sale",
      "source": "dealstream",
      "category": "Accounting and Tax Practices",
      "location": "New Jersey",
      "asking_price": "1,100,000",
      "sales_price": "890,000",
      "cash_flow": "739,000",
      "Ebita": "739,000",
      "listing_photo": "https://res.cloudinary.com/mergernetwork/image/upload/h_400,f_auto/posts/8FB19592-9971-46B9-B94FC57726E263F0",
      "Listed_by": {
        "person_name": null,
        "person_image": null,
        "person_other_info": []
      },
      "description": "Total Gross Income:  $890,000\r\nNet Profit: $739,000 with Owner add backs\r\nPurchase Price: $1,100,000 – Financing available to qualified applicants. Various programs available. Call for details.\r\n\r\nYear Established: 1991\r\n\r\nAccounting, bookkeeping, Compilations:\r\nMonthly Clients: 31  \tAvg Fee: $500 \tTotal:...",
      "details": [
        "Total Gross Income:  $890,000\rNet Profit: $739,000 with Owner add backs\rPurchase Price: $1,100,000 – Financing available to qualified applicants. Various programs available. Call for details.\r\rYear Established: 1991\r\rAccounting, bookkeeping, Compilations:\rMonthly Clients: 31  \tAvg Fee: $500 \tTotal: $198,600\rQuarterly Clients: 34 \tAvg Fee: $3,600\tTotal: $123,400\r\rIncome Tax:\rIndividuals: 800      \tAvg Fee: $ 400\tTotal: $345,000\rAnnual Taxes\t \tTotal: $100,000\r\rAudits, Reviews\r1 Review, not for profit\tTotal:$   6,000\r\rOther Services\rAnnuals and special work\tTotal:$   117,000\r\rFull-time Employees:  1 \rPart-time Employees: 2\r\rComputer Software:  QuickBooks, Drake, ATX Payroll and ATX Forms\r\rDescription of Clientele:  Machine shops, Taxi, Medical, Retail, Restaurants, Landscapers, Clothing and Wholesale Bakery.  Most of these clients have been with us 10 years.\r\rDescription of Area:  Suffolk County, Northshore of Long Island in the port Jefferson area.  Wine country, Hamptons, Montauk and Greenport all within one hour."
      ]
    },
    {
      "ad_id": "ihvyep",
      "article_url": "https://dealstream.com/d/biz-sale/painting/ihvyep",
      "title": "Prime Painting Business for Sale in New Jersey",
      "source": "dealstream",
      "category": "Painting Contractors",
      "location": "New Jersey",
      "asking_price": "160,000",
      "sales_price": "700,000",
      "cash_flow": "110,000",
      "Ebita": "110,000",
      "listing_photo": "https://res.cloudinary.com/mergernetwork/image/upload/h_400,f_auto/posts/7235B3A5-2954-498D-9B713F9C405428B9",
      "Listed_by": {
        "person_name": null,
        "person_image": null,
        "person_other_info": []
      },
      "description": "Step into ownership of a successful painting business in New Jersey, NJ, with a strong track record of delivering exceptional residential and commercial painting services. This business has built a solid reputation for its high-quality workmanship, reliability, and customer satisfaction. The company...",
      "details": [
        "Step into ownership of a successful painting business in New Jersey, NJ, with a strong track record of delivering exceptional residential and commercial painting services. This business has built a solid reputation for its high-quality workmanship, reliability, and customer satisfaction. The company offers a wide range of services, including interior and exterior painting, surface preparation, and color consultations, making it a one-stop solution for all painting needs. With a loyal customer base and numerous positive reviews, this business is well-positioned for continued success.\r\rHighlights:\r\r Known for high-quality workmanship and reliability\r Comprehensive range of interior and exterior painting services\r Opportunity to expand services and customer base\r Ready for immediate ownership with trained staff and established procedures\r\rThis is a rare opportunity to acquire a thriving business in a lucrative market. Contact us today to learn more about this outstanding investment!"
      ]
    },
    {
      "ad_id": "niz3o6",
      "article_url": "https://dealstream.com/d/biz-sale/construction/niz3o6",
      "title": "Local, Content Damage Restoration Company",
      "source": "dealstream",
      "category": "Construction",
      "location": "Hempstead, NY",
      "asking_price": "299,900",
      "sales_price": "1,600,000",
      "cash_flow": "400,000",
      "Ebita": "400,000",
      "listing_photo": null,
      "Listed_by": {
        "person_name": null,
        "person_image": null,
        "person_other_info": []
      },
      "description": "The sale price includes a vehicle, an extensive equipment package, storage vaults and everything needed to run daily operations. Included are built-in National accounts and access to third-party insurance administrators. We also receive referral business from property restoration companies inside the...",
      "details": [
        "The sale price includes a vehicle, an extensive equipment package, storage vaults and everything needed to run daily operations. Included are built-in National accounts and access to third-party insurance administrators. We also receive referral business from property restoration companies inside the territory. This is an extremely high margin, proven recession resistant residential, B2B and B2C company. Excellent profit margins with high earnings. The average per ticket transaction is large. This business is great for someone with excellent executive management and project management skills. In addition, if you are a person that excels at bringing different parties together focused on completing projects this is a great fit for you. Contents restoration is covered by insurance. For an insurance company, it's much less expensive to clean and restore an item than it is to replace it. For a homeowner or property owner, they'd usually much rather have their item that has sentimental value. Included in this sale is extensive training as well as ongoing support. As the new owner, you will provide financial oversight, building relationships, and networking in the community. In addition, included in this sale, there are many existing insurance company relationships and restoration businesses providing reoccurring and ongoing revenue. This “essential” and needs based service business is highly scalable with continued growth potential."
      ]
    },
    {
      "ad_id": "9w7ae3",
      "article_url": "https://dealstream.com/d/biz-sale/pet-grooming/9w7ae3",
      "title": "Recession Resistant Dog Training Franchise",
      "source": "dealstream",
      "category": "Pet Grooming and Boarding, Kennels, Catteries",
      "location": "Bonita Springs, FL",
      "asking_price": "225,000",
      "sales_price": "462,389",
      "cash_flow": "110,000",
      "Ebita": "110,000",
      "listing_photo": "https://res.cloudinary.com/mergernetwork/image/upload/h_400,f_auto/posts/681DC254-21B3-4FA9-94A894B4AACE087F",
      "Listed_by": {
        "person_name": "Brett Sargent",
        "person_image": "<img src=\"https://res.cloudinary.com/mergernetwork/image/upload/c_crop,x_-147,y_-21,w_1546,h_1546,a_0/w_125,h_125,c_pad,f_auto/v1701313906/profiles/2F83AE32-B002-4E0C-B23E5244E6EDDA71.jpg\" class=\"profileThumb d125 borderless\">",
        "person_other_info": [
          "Member Since Jan 7, 2020",
          "Languages Spoken English (Primary), Hungarian, Russian, Ukrainian\n",
          "\n\t\t\t\t\tIndustry \n\t\t\t\t\tBusiness Brokerage\n\t\t\t\t",
          "\n\t\t\t\t\tLocation \n\t\t\t\t\tEl Dorado Hills, California United States\n\t\t\t\t"
        ]
      },
      "description": "Recession Resistant Dog Training Franchise SC2148\r\n\r\nThis Recession Resistant Florida based Dog Training Franchise is a Florida Limited Liability Company and has been in operation for the past 8 years and under the current ownership for the past 6 years. This franchise is the nation’s top franchise...",
      "details": [
        "Recession Resistant Dog Training Franchise SC2148\r\rThis Recession Resistant Florida based Dog Training Franchise is a Florida Limited Liability Company and has been in operation for the past 8 years and under the current ownership for the past 6 years. This franchise is the nation’s top franchise when it comes to dog training. They have approximately 2 years remaining on the franchise agreement. They provide day camp training, private lessons, and group classes. They also offer specialty classes and puppy classes. Additional services include daycare, boarding, grooming and the potential to grow further into these services. There are almost 160 franchise locations across the United States. There is not just dog training service revenue, but also merchandise sales at these locations as well. Since this location is in Florida, they receive seasonal clients from the other 160 locations which also provides additional revenue.\r\rAsking Price $225,000\rCash Flow $110,000\rGross Revenue $462,389\rDown Payment $225,000\r\rBusiness Location: Bonita Springs, Lee County, Florida\r\rReason for Sale\rThe Seller is selling to pursue other interests.\r\rDetailed information\r\rYear Established: 2015\rHome Based: No\rFranchise: Yes\rRelocatable: No\rLender Prequalified: No\rSBA Prequalified: No\rFull-Time Employees: 3\rPart-Time Employees: 1\rContractors: N/A\rOwner Worked Hours/w: 40\rAdjusted EBITDA: $105,408\rInventory Included: Yes\rInventory Value: $2,000\rMonthly Rent: $4,400\rReal Estate Available: No\rReal Estate Included: No\rReal Estate Value: N/A\rBuilding Size: 2,336\rFF&E Included?: Yes\rFF&E Value: $50,000\rTraining/Support\r\rThere will need to be a 3-week certification course needed for the new owner, manager or designee. The Seller is willing to provide training at 30 hours per week for 4 weeks for the new Owner. Additional training can be made available at a mutually agreed upon cost to the new Owner.\rMarket Outlook/Competition\r\rThe $100 billion pet industry is poised to nearly triple to $275 billion by 2030 thanks to a surge in new owners, favorable demographics, and increased pet-per spending. The pandemic has upended the lives of humans, but for pets, it’s been a bonanza. Two-thirds of U.S. households have at least one pet, with 1.7 on average.\r\rCA 02100708\rNV 1003039"
      ]
    },
    {
      "ad_id": "o20d63",
      "article_url": "https://dealstream.com/d/biz-sale/manufacturing/o20d63",
      "title": "Distribution and Manufacturing Portfolio",
      "source": "dealstream",
      "category": "Manufacturing",
      "location": "New York, NY",
      "asking_price": "4,275,000",
      "sales_price": "11,147,775",
      "cash_flow": "959,860",
      "Ebita": "959,860",
      "listing_photo": "https://res.cloudinary.com/mergernetwork/image/upload/h_400,f_auto/posts/28DAF0B2-5213-40B5-9CF8A2BAB8191C6A",
      "Listed_by": {
        "person_name": null,
        "person_image": null,
        "person_other_info": []
      },
      "description": "Entity 1 (manufacturing) \r\nSpecializes in manufacturing custom die-cut corrugated and foam packaging. The company comes with commercial equipment, including a flatbed die cutter, a clam shell die cutter, and a clicker press, ensuring precision and versatility in production. They also possess a guillotine...",
      "details": [
        "Entity 1 (manufacturing) \rSpecializes in manufacturing custom die-cut corrugated and foam packaging. The company comes with commercial equipment, including a flatbed die cutter, a clam shell die cutter, and a clicker press, ensuring precision and versatility in production. They also possess a guillotine cutter for exact resizing and a glue machine for seamless substrate bonding. With 95% of their work being custom orders, they excel at delivering tailored packaging solutions that meet the unique needs of their clients. This capability allows them to maintain long-term relationships and consistent repeat business.\r\rEntity 2 Distribution (DTC & B2B)\rStarted as an e-commerce site and has successfully transitioned to a direct-to-consumer model, primarily through targeted mailers and catalogs. As a distribution company, they deliver high-quality packaging directly to end users This strategic shift has resulted in a loyal customer base, with the majority of sales coming from repeat business. The company sends out extensive marketing materials to a carefully curated list to repeat business owners, ensuring targeted outreach and effective market penetration.\r\rEntity 3\rExcels in the distribution of a wide range of packaging materials, similar to ULine, leveraging a robust network of referrals, strategic marketing, and a dedicated sales force. The company brokers products directly from manufacturers to customers. With a significant inventory of $350,000, they are well-positioned to meet the diverse needs of its clients promptly. Their strategic location and weekly brokerage activities enable them to maintain a steady flow of business and high customer satisfaction.\r\rTogether, these businesses offer a one-stop-shop for all packaging needs,\rwith a strong focus on customization, targeted marketing, and customer satisfaction.\r\rAsking Price: $4,275,000\rInventory (Included in asking\rprice): $650,000\rGross Revenue: $11,147,775\rS.D.E: $959,860\r\rFeel free to reach out for an NDA"
      ]
    },
    {
      "ad_id": "77h7sj",
      "article_url": "https://dealstream.com/d/biz-sale/dental-practices/77h7sj",
      "title": "Arkansas Dentist $1.1M+ Collections $500K Earnings",
      "source": "dealstream",
      "category": "Dental Practices, Clinics",
      "location": "Springdale, AR",
      "asking_price": "1,000,000",
      "sales_price": "1,130,036",
      "cash_flow": "516,179",
      "Ebita": "516,179",
      "listing_photo": "https://res.cloudinary.com/mergernetwork/image/upload/h_400,f_auto/posts/620F7DE9-D637-4F8B-97A8456521B0190E",
      "Listed_by": {
        "person_name": null,
        "person_image": null,
        "person_other_info": []
      },
      "description": "This well established, thriving and extremely\r\nprofitable dental practice is located in a\r\nCentral Arkansas city of around 40,000 people\r\nless than an hour away from Little Rock. It has\r\nbeen in operation for decades and\r\nconsistently does over a million dollars in\r\ncollections for the selling dentist...",
      "details": [
        "This well established, thriving and extremely\rprofitable dental practice is located in a\rCentral Arkansas city of around 40,000 people\rless than an hour away from Little Rock. It has\rbeen in operation for decades and\rconsistently does over a million dollars in\rcollections for the selling dentist each year. It\rhas a very established patient base with\rreliable and seasoned employees already in\rplace. The practice concentrates on general,\rpreventative and cosmetic restorative\rdentistry. The practice is modern, digital and\rhas five good-sized operating rooms in an\restablished location owned by the selling\rdentist that they are willing to sell with the\rpractice. Everything is already set up and\rready for a new dentist to come in and take\rover. The selling dentist is also willing to stay\ron for a negotiated time to help with the\rtransition. Financing is also available for\rqualified buyers with our lending program\rthat gets you in front of many lenders who\rcompete for your business to get you the best\rterms on a loan. Contact us today to learn\rmore."
      ]
    },
    {
      "ad_id": "ey9t5n",
      "article_url": "https://dealstream.com/d/biz-sale/waste-management/ey9t5n",
      "title": "Environmental Site Assessment and Remediation",
      "source": "dealstream",
      "category": "Waste Management and Remediation Services",
      "location": "Bohemia, NY",
      "asking_price": "500,000",
      "sales_price": "400,000",
      "cash_flow": "160,000",
      "Ebita": "160,000",
      "listing_photo": "https://res.cloudinary.com/mergernetwork/image/upload/h_400,f_auto/posts/DB479699-4CF7-4AFB-BFCD7586F83F1B47",
      "Listed_by": {
        "person_name": null,
        "person_image": null,
        "person_other_info": []
      },
      "description": "This Long Island based environmental remediation services business provides a comprehensive suite of services that span from site assessments to waste management. Its reputation of excellence is built on established long-term client relationships with state and local regulatory agencies, transportation,...",
      "details": [
        "This Long Island based environmental remediation services business provides a comprehensive suite of services that span from site assessments to waste management. Its reputation of excellence is built on established long-term client relationships with state and local regulatory agencies, transportation, commercial real estate brokers, property management companies, industrial companies and engineering firms across Long Island and New York City. \r\rThis is a home-based business. Seller is active with 2PT employees. Hours of operation are 8:30am-5:00pm Monday-Friday. Other Assets include Aeration Rods, Hoses, Sample Auger, Battery Charger. Waste Permit required."
      ]
    },
    {
      "ad_id": "9da7pj",
      "article_url": "https://dealstream.com/d/biz-sale/accounting/9da7pj",
      "title": "Western Atlanta Suburbs, Georgia Practice for Sale",
      "source": "dealstream",
      "category": "Accounting and Tax Practices",
      "location": "Atlanta, GA",
      "asking_price": "550,000",
      "sales_price": "500,000",
      "cash_flow": "155,000",
      "Ebita": "155,000",
      "listing_photo": "https://res.cloudinary.com/mergernetwork/image/upload/h_400,f_auto/posts/DD45FC6E-ACA5-4898-969E03A69F95C64F",
      "Listed_by": {
        "person_name": null,
        "person_image": null,
        "person_other_info": []
      },
      "description": "Total Gross Income:  $500,000\r\n\r\nNet Profit:  $155,000 with owner add backs\r\n\r\nPurchase Price: $550,000 – Financing available to qualified applicants. Various programs available. Call for details.\r\n\r\nYear Established:  1998\r\n\r\nAccounting, bookkeeping, Compilations:\r\nMonthly Clients: 41\tAvg Fee: $321...",
      "details": [
        "Total Gross Income:  $500,000\r\rNet Profit:  $155,000 with owner add backs\r\rPurchase Price: $550,000 – Financing available to qualified applicants. Various programs available. Call for details.\r\rYear Established:  1998\r\rAccounting, bookkeeping, Compilations:\rMonthly Clients: 41\tAvg Fee: $321 \tTotal: $159,546\rQuarterly Clients   9\tAvg Fee: $458\tTotal: $    4,125\rAnnual Clients:   15\tAvg Fee: $883\tTotal: $  13,231\r\rIncome Tax:\rIndividuals: 634\tAvg Fee: $312\tTotal: $197,771 \rBusinesses:   69\tAvg Fee: $735\tTotal: $  50,726\rOther:  16\tAvg Fee: $785\tTotal: $    4,650\r\rOther Services\rPayroll\tTotal: $  52,171\rOther \tTotal: $    17,241\r\rFull-time Employees: 2\r\rPart-time Employees: 2   plus 2 Seasonal\r\rComputer Software:  QuickBooks Desktop and Online, Proseries, Financial Cents, Smart Vault and Sharefile\r\rDescription of Clientele:  Business with income from $100,000 to $16,000,000. 80% of companies are small simple businesses.\r\rDescription of Area:  Small town surrounded by a number of other small towns about 15 miles west of Atlanta, Georgia.\r\rOther Information:  We have been providing Tax Resolution Work and Tax Planning for about 5 years without marketing them.  We are redoing our website and marketing to pursue Tax Resolution, Tax Planning , CAS, and Fractional CFO Services."
      ]
    },
    {
      "ad_id": "6iryas",
      "article_url": "https://dealstream.com/d/biz-sale/medical-practices/6iryas",
      "title": "Growing Urgent Care with Drug Testing Contracts",
      "source": "dealstream",
      "category": "Medical Practices, Clinics, Therapy Centres",
      "location": "Florida",
      "asking_price": "1,300,000",
      "sales_price": "1,049,000",
      "cash_flow": "345,000",
      "Ebita": "345,000",
      "listing_photo": null,
      "Listed_by": {
        "person_name": null,
        "person_image": null,
        "person_other_info": []
      },
      "description": "The primary care side still uses the urgent care side for insurance billing purposes while it gets\r\nfully credentialed.\r\nThe Urgent Care side is fully credentialed with all insurance carriers.\r\n eClinicalWorks is their Electronic Medical Records EMR software.\r\n They just recently started their primary...",
      "details": [
        "The primary care side still uses the urgent care side for insurance billing purposes while it gets\rfully credentialed.\rThe Urgent Care side is fully credentialed with all insurance carriers.\r eClinicalWorks is their Electronic Medical Records EMR software.\r They just recently started their primary care branch after inheriting hundreds of patients from a\rmedical practice where the owner passed. They currently see 30 patients a day and the seller\rsaid if they were in better shape they could see closer to 40 a day for primary care.\r The primary care division sees patients only 4 days a week due to the seller's health.\r The urgent care division sees 45 to 65 patients a day averaging 220 to 240 patients a week.\rDue to the seller's health, Urgent Care went from 7 days a week to opening only 4 days a week.\r They also shortened the hours, so the business was easier to handle.\r Their customer base is typically covered under Tricare, BlueCross BlueShield or Medicare.\r The primary care practice is credentialed with most of the major insurance companies.\r The urgent care division currently handles workers comp cases, DOT physicals, physicals for\rsummer camps, physicals for school bus drivers, physicals for high schools, nursing home and\rphysicals for law enforcement/ fire department and city employees.\r Drug testing for all city employees and construction companies and recently signed contracts. \r Urgent Care also issues prescriptions, take mammograms, and does blood work.\r There are 6 exam rooms. Two separate areas, one for Urgent Care Patients and one for Primary\rCare patients.\r Waiting room seats up to 14 people.\r There is an IV room with 6 beds in it..\r All of the contracts are for the practice with insurance companies rather than through\rindividuals.\r There are no medical facilities nearby.\r All of the workers live locally.\r The Business can run all kinds of blood and urine testing in house, health/IV Lounge treatments,\rEKG/Lung examinations, burn care, skin care, eye injuries, sutures, and can perform ultrasounds.\rDoctor will assist as long as possible. Willing to do TeleMed to help.\r\rPlease Note, Large Cash component."
      ]
    },
    {
      "ad_id": "qbf0js",
      "article_url": "https://dealstream.com/d/biz-sale/pharmacies/qbf0js",
      "title": "NY Retail Pharmacy",
      "source": "dealstream",
      "category": "Pharmacies, Drug Stores, Chemists",
      "location": "New York",
      "asking_price": "5,200,000",
      "sales_price": "29,595,113",
      "cash_flow": "2,943,565",
      "Ebita": "2,943,565",
      "listing_photo": "https://res.cloudinary.com/mergernetwork/image/upload/h_400,f_auto/posts/3026FA5D-F430-4088-AE8E733BFD40B8D5",
      "Listed_by": {
        "person_name": null,
        "person_image": null,
        "person_other_info": []
      },
      "description": "This pharmacy in the the Boroughs is fully licensed with clean contracts.  \r\nAll staff is fully trained and passionate about assisting the community (English, Russian and Spanish speaking staff).  \r\n\r\nAnnual Sales\t$29,595,113.00\r\nGross Profit\t$6,541,175.00\r\nEBITDA\t$2,943,565.00\r\nAnnual Rx Count\t140179\r\n\r\nAsking...",
      "details": [
        "This pharmacy in the the Boroughs is fully licensed with clean contracts.  \rAll staff is fully trained and passionate about assisting the community (English, Russian and Spanish speaking staff).  \r\rAnnual Sales\t$29,595,113.00\rGross Profit\t$6,541,175.00\rEBITDA\t$2,943,565.00\rAnnual Rx Count\t140179\r\rAsking Price\t$5,200,000 plus inventory (excluding cash, cash equivalents and A/R)"
      ]
    },
    {
      "ad_id": "arczu5",
      "article_url": "https://dealstream.com/d/biz-sale/flooring/arczu5",
      "title": "SE Idaho Wood Flooring Experts",
      "source": "dealstream",
      "category": "Flooring Contractors",
      "location": "Bannock County, ID",
      "asking_price": "285,000",
      "sales_price": "236,178",
      "cash_flow": "109,978",
      "Ebita": "109,978",
      "listing_photo": "https://res.cloudinary.com/mergernetwork/image/upload/h_400,f_auto/posts/0B41F6A1-5406-483E-9C575F9DF164BD12",
      "Listed_by": {
        "person_name": null,
        "person_image": null,
        "person_other_info": []
      },
      "description": "Bringing over 28 years of flooring expertise to Southeastern Idaho, this wood flooring company offers quality installation, dustless sanding, refinishing, and repairs. With a commitment to quality and honest service, the business has established a strong reputation and almost no competition in the market.\r\n\r\nA...",
      "details": [
        "Bringing over 28 years of flooring expertise to Southeastern Idaho, this wood flooring company offers quality installation, dustless sanding, refinishing, and repairs. With a commitment to quality and honest service, the business has established a strong reputation and almost no competition in the market.\r\rA key asset to potential buyers is the long-time employee who possesses extensive industry experience and can seamlessly assume the role of General Manager. This ensures continuity in operations and management, particularly advantageous for buyers not based locally. The company enjoys a lucrative market with significant growth potential, evidenced by its upward sales trend and impressive profitability.\r\rProudly serving the area, this business presents a prime opportunity for buyers looking to enter or expand in the wood flooring industry.\r\rThis is home-based and relocatable. Seller is active with 2 FT employees. Hours of operation are 8am – 5pm Monday to Friday. $50,000 in FF&E included in the asking Price."
      ]
    },
    {
      "ad_id": "tfbvcs",
      "article_url": "https://dealstream.com/d/biz-sale/concrete/tfbvcs",
      "title": "Concrete Repair, Staining, Texturing, Polishing",
      "source": "dealstream",
      "category": "Concrete and Cement Contractors",
      "location": "Boise, ID",
      "asking_price": "420,000",
      "sales_price": "515,000",
      "cash_flow": "210,000",
      "Ebita": "210,000",
      "listing_photo": "https://res.cloudinary.com/mergernetwork/image/upload/h_400,f_auto/posts/509B4C2D-93A6-4FAC-A7B9DE6DAB3C1FBD",
      "Listed_by": {
        "person_name": null,
        "person_image": null,
        "person_other_info": []
      },
      "description": "With three years of successful operation, this established franchise in Treasure Valley has solidified its reputation as a leading service provider of concrete repair, staining, texture, and polishing services. Boasting a track record of profitability and customer satisfaction, this business presents...",
      "details": [
        "With three years of successful operation, this established franchise in Treasure Valley has solidified its reputation as a leading service provider of concrete repair, staining, texture, and polishing services. Boasting a track record of profitability and customer satisfaction, this business presents a lucrative opportunity for potential buyers seeking to capitalize on the growing demand for high-quality decorative concrete solutions in a very construction-hot Southwest Idaho market.\r\rSeller is active with 3FT employees. Hours of operation are 9am-5pm Mon-Fri. $30,000 in inventory and $130,000in FF&E included in the asking price. Other Assets include all needed tools and equipment needed for the business. State Contractor license required."
      ]
    },
    {
      "ad_id": "ignwn2",
      "article_url": "https://dealstream.com/d/biz-sale/long-haul-trucking/ignwn2",
      "title": "Profitable Refrigerated Trucking Powerhouse",
      "source": "dealstream",
      "category": "Long Haul Trucking",
      "location": "Salt Lake City, UT",
      "asking_price": "7,495,000",
      "sales_price": "7,844,320",
      "cash_flow": "2,304,306",
      "Ebita": "2,304,306",
      "listing_photo": "https://res.cloudinary.com/mergernetwork/image/upload/h_400,f_auto/posts/8C6B4150-F5EF-4870-BE07C9AE7124CB6C",
      "Listed_by": {
        "person_name": null,
        "person_image": null,
        "person_other_info": []
      },
      "description": "This established Utah trucking company offers a winning combination of experience and growth potential. Specializing in refrigerated, tanker, and dry van trucking for all 48 states, they operate 24/7 with a reliable fleet of new equipment. Their long-standing client relationships and well-defined processes...",
      "details": [
        "This established Utah trucking company offers a winning combination of experience and growth potential. Specializing in refrigerated, tanker, and dry van trucking for all 48 states, they operate 24/7 with a reliable fleet of new equipment. Their long-standing client relationships and well-defined processes ensure clear communication and on-time deliveries. With a strong upward sales trend and a dedicated team in place, this business is primed for further success in the hands of the right buyer. \r\rThis is a leased location of 1500 square feet with a Total monthly rent of $2200. Lease is month to month. Seller is active with 28FT and 2PT employees. Hours of operation are 24/7. $4,811,000 in FF&E included in the asking price."
      ]
    },
    {
      "ad_id": "q71wlm",
      "article_url": "https://dealstream.com/d/biz-sale/waste-management/q71wlm",
      "title": "Busy and Profitable Junk Hauling Business",
      "source": "dealstream",
      "category": "Waste Management and Remediation Services",
      "location": "Boston, MA",
      "asking_price": "229,500",
      "sales_price": "875,000",
      "cash_flow": "210,000",
      "Ebita": "210,000",
      "listing_photo": null,
      "Listed_by": {
        "person_name": null,
        "person_image": null,
        "person_other_info": []
      },
      "description": "The business sale includes a Decaled Hauling Truck and National Accounts in place. This is a busy “eco-friendly - Green” junk removal and recycling business geared toward residential and commercial clients. The business has established a proven marketing system, with a detailed website and a corporate...",
      "details": [
        "The business sale includes a Decaled Hauling Truck and National Accounts in place. This is a busy “eco-friendly - Green” junk removal and recycling business geared toward residential and commercial clients. The business has established a proven marketing system, with a detailed website and a corporate call center available to answer in-coming calls while you are out serving customers and building the business. The Call Center manages calls and schedules jobs in real time. The business has multiple revenue streams and profit centers. This business has a verifiable cash flow and 10-year track record of success. Customers truly appreciate these services and are happy to pay their invoice after the debris and clean-up occurs. Full training and ongoing corporate support will be included with this sale."
      ]
    },
    {
      "ad_id": "fahsfh",
      "article_url": "https://dealstream.com/d/biz-sale/ecommerce/fahsfh",
      "title": "Profitable, Well Established, Online Auction",
      "source": "dealstream",
      "category": "E-Commerce",
      "location": "Idaho",
      "asking_price": "1,800,000",
      "sales_price": "2,000,000",
      "cash_flow": "540,000",
      "Ebita": "540,000",
      "listing_photo": "https://res.cloudinary.com/mergernetwork/image/upload/h_400,f_auto/posts/5724CC2C-D59E-4A50-A8DDE64876FFD108",
      "Listed_by": {
        "person_name": null,
        "person_image": null,
        "person_other_info": []
      },
      "description": "Founded in 2015, this on-line auction based in Southwest Idaho has established itself as a reputable and profitable marketplace with a loyal customer base of over 18,000 individuals and businesses. Over the past 10 years, the platform has gained recognition for providing a convenient and secure environment...",
      "details": [
        "Founded in 2015, this on-line auction based in Southwest Idaho has established itself as a reputable and profitable marketplace with a loyal customer base of over 18,000 individuals and businesses. Over the past 10 years, the platform has gained recognition for providing a convenient and secure environment for buying and selling a diverse range of products. With a user-friendly interface that simplifies the listing and bidding processes, it has become a go-to destination for buyers seeking unique items and sellers looking to reach a broad audience. The company's strategic marketing efforts have helped attract a large and engaged customer base, fostering trust and loyalty among its users. The business's success can be attributed to its unwavering commitment to exceptional customer service, strong security measures, and a transparent pricing structure. By prioritizing customer satisfaction and maintaining a focus on building lasting relationships with buyers and sellers, the platform has achieved consistent financial growth and stability over the years. Looking ahead, the business remains dedicated to innovation and expansion, with plans to introduce new offerings and enhance the overall auction experience for customers in Southwest Idaho and beyond. With a proven track record of success, a specialized area of service and a strong foundation built on excellence, the business is well-positioned for continued growth and prosperity in the competitive on-line auction industry. \r\rThis is a leased location of 6,920 square feet with a Total monthly rent of $6,000. Lease is negotiable. Seller is active with 3FT and 2 contract employees. Hours of operation are 10am-4pm Mon-Fri. $5,000 in inventory and $69,850 in FF&E included in the asking price. Other Assets include the website, various social media sites, tools, 18,000 customer databases."
      ]
    },
    {
      "ad_id": "401on3",
      "article_url": "https://dealstream.com/d/biz-sale/paving/401on3",
      "title": "Profitable Full-Service Asphalt & Paving Company",
      "source": "dealstream",
      "category": "Paving Contractors",
      "location": "Salt Lake County, UT",
      "asking_price": "1,000,000",
      "sales_price": "1,191,296",
      "cash_flow": "368,892",
      "Ebita": "368,892",
      "listing_photo": "https://res.cloudinary.com/mergernetwork/image/upload/h_400,f_auto/posts/F4096882-A516-4C52-806A7C4CEA9767B0",
      "Listed_by": {
        "person_name": null,
        "person_image": null,
        "person_other_info": []
      },
      "description": "This thriving full-service asphalt and paving company in Salt Lake County is experiencing robust revenue growth and boasts a healthy Seller's Discretionary Earnings (SDE). Key employees are committed to staying on, ensuring a smooth transition. The business is thriving thanks to its strong referrals,...",
      "details": [
        "This thriving full-service asphalt and paving company in Salt Lake County is experiencing robust revenue growth and boasts a healthy Seller's Discretionary Earnings (SDE). Key employees are committed to staying on, ensuring a smooth transition. The business is thriving thanks to its strong referrals, and stellar reputation. Its competitive edge includes extensive experience, a dedicated team, and exceptional professionalism. Easily relocatable and currently home-based, this business presents significant growth opportunities and is an ideal investment for buyers seeking a thriving, expandable enterprise. \r\r Seller is active with 3FT and 6 Contract employees. Hours of operation are 9 am - 5 pm Monday-Friday. $179,000 in FF&E included in the asking price. General Contractors license required."
      ]
    },
    {
      "ad_id": "th6x7b",
      "article_url": "https://dealstream.com/d/biz-sale/food-distributors/th6x7b",
      "title": "Profitable Healthy Food Distribution Business",
      "source": "dealstream",
      "category": "Food Distributors",
      "location": "Boston, MA",
      "asking_price": "135,000",
      "sales_price": "434,000",
      "cash_flow": "114,000",
      "Ebita": "114,000",
      "listing_photo": null,
      "Listed_by": {
        "person_name": null,
        "person_image": null,
        "person_other_info": []
      },
      "description": "Quality and healthy snack distribution business with territory in MA, NH, and RI. Flexible and simple business model with current cash flow from existing clients. This is a franchise but there are no royalties and low overhead with this model. Low turnover of clients means that the business keeps growing...",
      "details": [
        "Quality and healthy snack distribution business with territory in MA, NH, and RI. Flexible and simple business model with current cash flow from existing clients. This is a franchise but there are no royalties and low overhead with this model. Low turnover of clients means that the business keeps growing year after year as you continue to open new accounts. Take advantage of the large (6 million people) territory to expand the client base serviced. Market to hospitals, universities, sports clubs, etc., and add retail sales if you want.\r\rThe franchisor has modeled the business system for first-time entrepreneurs and experienced business owners who desire to impact a growing market. Be in business for yourself but not by yourself. The active franchisee network and franchisor support let you tap decades of experience to run your business.\r\rBusiness location and name will be shared once a qualified Buyer prospect is vetted."
      ]
    },
    {
      "ad_id": "ttna7t",
      "article_url": "https://dealstream.com/d/biz-sale/builders/ttna7t",
      "title": "Kitchen and Bath Remodeling Business for Sale",
      "source": "dealstream",
      "category": "General Contractors, Builders, Housebuilders",
      "location": "Mission Viejo, CA",
      "asking_price": "350,000",
      "sales_price": "763,045",
      "cash_flow": "237,002",
      "Ebita": "237,002",
      "listing_photo": null,
      "Listed_by": {
        "person_name": "Rick Carlson",
        "person_image": "<span class=\"fa fa-user profileThumb d125 borderless \"></span>",
        "person_other_info": [
          "Member Since Apr 27, 2009",
          "Languages Spoken English\n",
          "\n\t\t\t\t\tIndustry \n\t\t\t\t\tInvestment Banking\n\t\t\t\t",
          "\n\t\t\t\t\tLocation \n\t\t\t\t\tSanta Monica, California United States\n\t\t\t\t"
        ]
      },
      "description": "Are you interested in entering or expanding in the contracting industry? This is a remarkable opportunity to acquire a well-established contracting company with a legacy rooted in over 30 years of collective experience. The Sellers have honed their craft, built a stellar industry reputation, and are...",
      "details": [
        "Are you interested in entering or expanding in the contracting industry? This is a remarkable opportunity to acquire a well-established contracting company with a legacy rooted in over 30 years of collective experience. The Sellers have honed their craft, built a stellar industry reputation, and are known for exceptional craftsmanship, trustworthiness, and meeting project deadlines. As a family-owned operation, they prioritize personalized service and strong vendor relationships, partnering with top-tier brands to ensure clients receive the best materials. Their impressive showroom aids informed decisions in home renovations, with a specialization in high ROI segments like kitchen and bathroom remodeling. Don't miss the chance to take over this reputable contracting business with the potential for further growth and continue its legacy of excellence in home renovation projects.\r\r\r\rDetailed Information\r\rFacilities: The showroom boasts four complete mock kitchens and two full mock bathrooms, offering an abundance of samples to help clients vividly imagine their ideal kitchen and bathroom renovations. It is situated within a well-trafficked residential shopping area, near luxury car dealerships, and conveniently near a major freeway.\r\rCompetition: A customer might opt for the competition due to their offering of refacing services, which this Company does not provide. Nonetheless, the Company concentrates on delivering exceptionally detailed services while leveraging targeted marketing and SEO strategies to maintain a competitive edge.\r\rGrowth & Expansion: To foster growth and expansion, consider diversifying the range of services offered, increasing investment in marketing, and expanding the sales team.\r\rFinancing: TBD if structure and terms are acceptable.\r\rSupport & Training: To ensure a smooth transition and ongoing success the Sellers will work with a buyer as needed with negotiated terms.\r\rReason for Selling: The Sellers are ready to retire."
      ]
    },
    {
      "ad_id": "vziwsa",
      "article_url": "https://dealstream.com/d/biz-sale/other-mfg/vziwsa",
      "title": "Beauty & Cosmetics Manufacturer",
      "source": "dealstream",
      "category": "Other Manufacturing",
      "location": "Indianapolis, IN",
      "asking_price": "1,600,000",
      "sales_price": "1,600,000",
      "cash_flow": "426,000",
      "Ebita": "426,000",
      "listing_photo": null,
      "Listed_by": {
        "person_name": null,
        "person_image": null,
        "person_other_info": []
      },
      "description": "Established in 2016, this Company started as a consulting side venture by its founder, a beauty entrepreneur who built her brand from her college dorm and later moved to China to explore manufacturing possibilities. With the challenges of the Indie Beauty sector in mind, this Company has evolved into...",
      "details": [
        "Established in 2016, this Company started as a consulting side venture by its founder, a beauty entrepreneur who built her brand from her college dorm and later moved to China to explore manufacturing possibilities. With the challenges of the Indie Beauty sector in mind, this Company has evolved into a full-service beauty lab dedicated to aiding entrepreneurs in every aspect of brand development—from conceptualization to production. Recognized as \"the beauty lab for entrepreneurs,\" this Company offers flexible, small-batch manufacturing solutions and has successfully developed over 700 formulations for more than 400 brands, making it a trusted partner in the beauty industry.\r\rThis Company adopts a flexible, scalable business model, specializing in clean and indie beauty, as well as a comprehensive CBD/cannabis catalog. This approach allows them to be at the forefront of market trends and innovations. They have even received state grants for their pioneering work. Their commitment to quality, innovation, and a customer-centric approach has not only solidified their reputation but also positioned them as industry leaders. With plans to grow revenue by 40-50% while maintaining team size, this Company stands as a beacon of resilience and innovation in the competitive beauty landscape."
      ]
    }